package model.monster.type;

/**
 * タイプ間の相性を保持するクラス
 * @author 1
 *
 */
public class EffectivenessChecker {
	
	//タイプ相性を表す二次元配列
	private double[][] effectiveness;
	
	//TODO データベースから取得する
	public EffectivenessChecker(){
		
		//effectiveness = new int[18][18];

		//縦軸=攻撃側のタイプ
		double[][] chart = {
				//0, 1, 2, 3, 4, 5, 6, 7, 8, 9,10,11,12, 13, 14,15,16, 17, 18
				{ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,  0,  0, 0, 0,  0, 0},	//タイプなし[0]
				{99, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.5, 0, 1, 1, 0.5, 1},	//ノーマル[1]
				{99, 1, 0.5, 0.5, 1, 2, 2, 1, 1, 1, 1, 1, 2, 0.5, 1, 0.5, 1, 2, 1},	//ほのお[2]
				{99, 1, 2, 0.5, 1, 0.5, 1, 1, 1, 2, 1, 1, 1, 2, 1, 0.5, 1, 1, 1},	//みず[3]
				{99, 1, 1, 2, 0.5, 0.5, 1, 1, 1, 0, 2, 1, 1, 1, 1, 0.5, 1, 1, 1},	//でんき[4]
				{99, 1, 0.5, 2, 1, 0.5, 1, 1, 0.5, 2, 0.5, 1, 0.5, 2, 1, 0.5, 1, 0.5, 1},	//くさ[5]
				{99, 1, 0.5, 0.5, 1, 2, 0.5, 1, 1, 2, 2, 1, 1, 1, 1, 2, 1, 0.5, 1},	//こおり[6]
				{99, 2, 1, 1, 1, 1, 2, 1, 0.5, 1, 0.5, 0.5, 0.5, 2, 0, 1, 2, 2, 0.5},	//かくとう[7]
				{99, 1, 1, 1, 1, 2, 1, 1, 0.5, 0.5, 1, 1, 1, 0.5, 0.5, 1, 1, 0, 2},	//どく[8]
				{99, 1, 2, 1, 2, 0.5, 1, 1, 2, 1, 0, 1, 0.5, 2, 1, 1, 1, 2, 1},	//じめん[9]
				{99, 1, 1, 1, 0.5, 2, 1, 2, 1, 1, 1, 1, 2, 0.5, 1, 1, 1, 0.5, 1},	//ひこう[10]
				{99, 1, 1, 1, 1, 1, 1, 2, 2, 1, 1, 0.5, 1, 1, 1, 1, 0, 0.5, 1},	//エスパー[11]
				{99, 1, 0.5, 1, 1, 2, 1, 0.5, 0.5, 1, 0.5, 2, 1, 1, 0.5, 1, 2, 0.5, 0.5},	//むし[12]
				{99, 1, 2, 1, 1, 1, 2, 0.5, 1, 0.5, 2, 1, 2, 1, 1, 1, 1, 0.5, 1},	//いわ[13]
				{99, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 1, 1, 2, 1, 0.5, 1, 1},	//ゴースト[14]
				{99, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 1, 0.5, 0},	//ドラゴン[15]
				{99, 1, 1, 1, 1, 1, 1, 0.5, 1, 1, 1, 2, 1, 1, 2, 1, 0.5, 1, 0.5},	//あく[16]
				{99, 1, 0.5, 0.5, 0.5, 1, 2, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 0.5, 2},	//はがね[17]
				{99, 1, 0.5, 1, 1, 1, 1, 2, 0.5, 1, 1, 1, 1, 1, 1, 1, 2, 0.5, 1},	//フェアリー[18]	
		} ;
		effectiveness = chart;
	}
	
	/**
	 * 指定された2タイプの相性を返すメソッド
	 * @param attackType 攻撃側のタイプ
	 * @param diffenceType 防御側のタイプ
	 * @return 相性値
	 */
	public double checkEffectiveness(int attackType, int diffenceType){
		return effectiveness[attackType][diffenceType];
	}
	

	public double[][] getEffectiveness() {
		return effectiveness;
	}

	public void setEffectiveness(double[][] effectiveness) {
		this.effectiveness = effectiveness;
	}
}
